//=============================================================================
//フェードの処理
//=============================================================================
#ifndef	FADE_H_
#define FADE_H_

//-----------------------------------------------------------------------------
//構造体
//-----------------------------------------------------------------------------
//フェードの状態
typedef enum
{
	FADE_NONE = 0,       //フェードしていない
	FADE_IN,            //フェードイン
	FADE_OUT,           //フェードアウト
	FADE_MAX,           //種類の総数
}FADE;

//-----------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------
void InitFade(MODE modeNext);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(MODE modeNext);
FADE *GetFade(void);
#endif