//-----------------------------------------------------------------------------
// サウンド処理 [sound.h]
// Author : 齋藤幸宏
//---------------------------------------------------------------------------- -
#ifndef _SOUND_H_
#define _SOUND_H_

//-----------------------------------------------------------------------------
//インクルードファイル
//-----------------------------------------------------------------------------
#include "Main.h"

//-----------------------------------------------------------------------------
// サウンドファイル
//-----------------------------------------------------------------------------
typedef enum
{
	SOUND_LABEL_BGM001,			//Title
	SOUND_LABEL_BGM02,			//Result
	SOUND_LABEL_BGM03,			//ゲーム画面
	SOUND_LABEL_BGM004,			//銃撃音
	SOUND_LABEL_BGM005,			//ドラゴンの鳴き声
	SOUND_LABEL_BGM006,			//撃破音
	SOUND_LABEL_BGM007,			//セレクト画面
	SOUND_LABEL_Enter000,		//エンター音
	SOUND_LABEL_MAX,

} SOUND_LABEL;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitSound(HWND hWnd);
void UninitSound(void);
HRESULT PlaySound(SOUND_LABEL label);
void StopSound(SOUND_LABEL label);
void StopSound(void);
#endif